var ex = []
var  a = []
var  b = []
var  c = []
var  d = []

//1 `
  for(let i =1; i<=4; i++){
    ex[i]= "จงหาพจน์ที่ 31 ของลำดับเลขคณิต 2, 6, 10, 14,..."
     a[i]= "122"
     b[i]= "120"
     c[i]= "124"
     d[i]= "125"
  }
 //2 `
 for(let i =5; i<=8; i++){
  ex[i]= "จำนวนเต็มที่อยู่ระหว่าง 100 และ 400 ที่หารด้วย 9 ลงตัวมีกี่จำนวน"
   a[i]= "33"
   b[i]= "31"
   c[i]= "32"
   d[i]= "34"
 }
 //3 `
 for(let i =9; i<=12; i++){
  ex[i]= "จงหาพจน์ที่ n ของลำดับเลขคณิต -10, -13, -16, ..."
   a[i]= "-7 - 3n"
   b[i]= "-13 - 3n"
   c[i]= "-13 + 3n"
   d[i]= "-7 + 3n"
 }
 //4 `
 for(let i =13; i<=16; i++){
  ex[i]= "ถ้าลำดับเลขคณิต คือ 2, -3, -8, -13, ... ผลต่างร่วมมีค่าเท่าใด"
   a[i]= "-5"
   b[i]= "-1"
   c[i]= "1"
   d[i]= "5"
 }
 //5 `
 for(let i =17; i<=20; i++){
   ex[i]= "ลำดับเลขคณิตมีพจน์ที่ห้าเท่ากับ 30 และพจน์ที่สิบเท่ากับ 55 จงหาพจน์ที่สิบห้าของลำดับเลขคณิตนี้"
   a[i]= "80"
   b[i]= "60"
   c[i]= "70"
   d[i]= "50"
  }
  //6 `
  for(let i =21; i<=24; i++){
   ex[i]= "กำหนดลำดับเรขาคณิต 1, 3, 9, ... อัตราส่วนร่วมของลำดับตรงกับข้อใด"
    a[i]= "3"
    b[i]= "`1/3`"
    c[i]= "1"
    d[i]= "9"
  }
  //7 `
  for(let i =25; i<=28; i++){
   ex[i]= "จงหาพจน์ที่ n ของลำดับเรขาคณิต 4, 8, 16, 32, ..."
    a[i]= "`2^(n+1)`"
    b[i]= "`2^n`"
    c[i]= "`2^(n-1)`"
    d[i]= "`2n`"
  }
  //8 `
  for(let i =29; i<=32; i++){
   ex[i]= "1024  เป็นพจน์ที่เท่าใดของลำดับเรขาคณิต 1, 2, 4, 8, ..."
    a[i]= "11"
    b[i]= "12"
    c[i]= "10"
    d[i]= "9"
  }
  //9 `
  for(let i =33; i<=36; i++){
   ex[i]= "จงหาอัตราส่วนร่วมของลำดับเรขาคณิตที่มี พจน์ที่ 3 เท่ากับ 63 พจน์ที่หกเท่ากับ 1701"
    a[i]= "3"
    b[i]= "7"
    c[i]= "-7"
    d[i]= "-3"
  }
  //10 `
  for(let i =37; i<=40; i++){
   ex[i]= "จงหาจำนวน 2 จำนวนที่อยู่ระหว่าง 5 และ 40 ที่ทำให้ลำดับนี้เป็นลำดับเรขาคณิต"
    a[i]= "10, 20"
    b[i]= "-10,-20"
    c[i]= "10,-20"
    d[i]= "-10, 20"
  }
  //11 `
  for(let i =41; i<=44; i++){
   ex[i]= "ข้อใดไม่เป็นอนุกรมเลขคณิต"
    a[i]= "3 + 6 + 12 + 24 + …"
    b[i]= "0 + 3 + 6 + 9 + …"
    c[i]= "3 + 5 + 7 + 9 …"
    d[i]= "4 + 8 + 12 + 16 + …"
  }
  //12 `
  for(let i =45; i<=48; i++){
   ex[i]= "ผลบวกอนุกรมเลขคณิต  4 + 8 + 12 + … + 80 มีค่าเท่ากับข้อใด"
    a[i]= "840"
    b[i]= "780"
    c[i]= "820"
    d[i]= "960"
  }
  // 13 `
  for(let i =49; i<=52; i++){
   ex[i]= "ผลบวก 8 พจน์แรกของอนุกรมเลขคณิต  4 + 9 + 14 + …  มีค่าเท่ากับข้อใด"
    a[i]= "172"
    b[i]= "344"
    c[i]= "516"
    d[i]= "612"
  }
  //14 `
  for(let i =53; i<=56; i++){
   ex[i]= "ผลบวกของจำนวนเต็มคู่บวกตั้งแต่ 1 ถึง 100 เท่ากับข้อใด"
    a[i]= "2,550"
    b[i]= "2,650"
    c[i]= "2,750"
    d[i]= "2,850"
  }
  //15 `
  for(let i =57; i<=60; i++){
   ex[i]= "ข้อใดเป็นผลบวกของจำนวนตั้งแต่ 160 ถึง 350 ซึ่ง 12 หารลงตัว"
    a[i]= "4,128"
    b[i]= "4,115 "
    c[i]= "4,132"
    d[i]= "4,144"
  }
  //16 `
  for(let i =61; i<=64; i++){
   ex[i]= "ข้อใดต่อไปนี้เป็นผลบวก n พจน์แรกของอนุกรมเรขาคณิต เมื่อกำหนดให้ `a_1` = 100 , n = 9 , r = 2"
    a[i]= "51,100"
    b[i]= "-51,130"
    c[i]= "-51,110"
    d[i]= "51,300"
  }
  //17 `
  for(let i =65; i<=68; i++){
   ex[i]= "จงหาค่า n ที่ทำให้อนุกรมเรขาคณิตอนุกรมหนึ่งมี `a_1` = 2, `S_n` = 10,922 , r = 4"
    a[i]= "7"
    b[i]= "5"
    c[i]= "6"
    d[i]= "8"
  }
  //18 `
  for(let i =69; i<=72; i++){
   ex[i]= "ผลบวก 10 พจน์แรกของอนุกรมเรขาคณิต 60 + 120 + 240 + … ตรงกับข้อใด"
    a[i]= "61,380"
    b[i]= "61,480"
    c[i]= "61,440"
    d[i]= "61,540"
  }
  //19 `
  for(let i =73; i<=76; i++){
   ex[i]= "ข้อใดต่อไปนี้เป็นผลบวก 8 พจน์แรกของอนุกรมเรขาคณิต (-4) + 8 + (-16) + …"
    a[i]= "340"
    b[i]= "-340"
    c[i]= "-320"
    d[i]= "320"
  }
  //20 `
  for(let i =77; i<=80; i++){
   ex[i]= "อนุกรมเรขาคณิตอนุกรมหนึ่งมีพจน์แรกเท่ากับ 4 และอัตราส่วนร่วมเท่ากับ  2 ถ้าผลบวก n พจน์แรกของอนุกรมนี้เท่ากับ 4,092  แล้วค่าของ n เท่ากับข้อใด"
    a[i]= "10"
    b[i]= "11"
    c[i]= "9"
    d[i]= "8"
  }
  //21 `
  for(let i =81; i<=84; i++){
   ex[i]= "อุดมทำงานได้เงินเดือน 12,000 บาท ในปีต่อไปอุดมได้ขึ้นเงินเดือนปีละ 500 บาททุกปี  อีก 10 ปีข้างหน้าอุดมได้เงินเดือนไร"
    a[i]= "16,500 บาท"
    b[i]= "17,000 บาท"
    c[i]= "17,500 บาท"
    d[i]= "18,000 บาท"
  }
  //22 `
  for(let i =85; i<=88; i++){
   ex[i]= "เดชากู้เงิน 40,000 บาท ผ่อนชำระร้อยละ 20 ต่อเดือน เมื่อผ่อนชำระไป 4 เดือน เดชาเหลือหนี้เท่าไร"
    a[i]= "16,384 บาท"
    b[i]= "16,257 บาท"
    c[i]= "16,425 บาท"
    d[i]= "16,586 บาท"
  }
  //23 `
  for(let i =89; i<=92; i++){
   ex[i]= "เทพีพรเก็บเงินวันละ 20, … , 110 บาท ตามลำดับ ซึ่งเป็นลำดับเลขคณิต จึงมีเงินเก็บรวบรวม 455 บาท เทพีพรเก็บเงินเพิ่มขึ้นวันละเท่าไร"
    a[i]= "15 บาท"
    b[i]= "14 บาท"
    c[i]= "12 บาท"
    d[i]= "10 บาท"
  }
  //24 `
  for(let i =93; i<=96; i++){
   ex[i]= "นภาเริ่มต้นทำงานเป็นผู้ช่วยพยาบาลที่โรงพยาบาลแห่งหนึ่งได้รับเงินเดือนในเดือนแรก 6,000 บาท แต่ได้เท่าเดิมตลอดปี  ถ้านภาได้รับเงินเดือนเพิ่มปีละ 300 บาททุกปี อยากทราบว่า อีก 10 ปีถัดไป นภาจะได้รับเงินเดือนเดือนละเท่าไร"
    a[i]= "9,000 บาท"
    b[i]= "7,000 บาท"
    c[i]= "8,000 บาท"
    d[i]= "10,000 บาท"
  }
  //25 `
  for(let i =97; i<=100; i++){
   ex[i]= "ดาด้าออมเงินไว้เพื่อซื้อโทรศัพท์ โดยวันแรกออมได้ 30 บาท วันที่สองออมได้ 40 บาท วันที่ 3 ออมได้ 50 บาท  เพิ่มขึ้นเช่นนี้เรื่อยไป จนกระทั่งถึงวันที่ 20 อยากทราบว่าเมื่อครบ 20 วัน ดาด้ามีเงินออมทั้งหมดเท่าไร",
    a[i]= "2,500 บาท"
    b[i]= "2,750 บาท"
    c[i]= "3,000 บาท"
    d[i]= "3,500 บาท"
  }
  //26 `
  for(let i =101; i<=104; i++){
   ex[i]= "จงหาสี่พจน์แรกของลำดับ `a_n` = n + 3"
    a[i]= "4, 5, 6, 7"
    b[i]= "3, 6, 9, 12"
    c[i]= "1, 2, 3, 4"
    d[i]= "1, 4, 5, 9"
  }
  //27 `
  for(let i =105; i<=108; i++){
   ex[i]= "จงหาพจน์ทั่วไปของลำดับเลขคณิต 1, 8, 15, 22, 29, ..."
    a[i]= "`a_n=7n-6`"
    b[i]= "`a_n=6n-7`"
    c[i]= "`a_n=7n+6`"
    d[i]= "`a_n=6n+7`"
  }
  //28 `
  for(let i =109; i<=112; i++){
   ex[i]= "จงหา 4 พจน์แรกของลำดับเรขาคณิตที่มี `3/4` เป็นพจน์แรก และ 4  เป็นอัตราส่วนร่วม"
    a[i]= "`3/4, 3, 12, 48`"
    b[i]= "`3/4, 12, 48, 96`"
    c[i]= "`3/4, 12, 36, 108`"
    d[i]= "`4/3, 4, 12, 48`"
  }
  //29 `
  for(let i =113; i<=116; i++){
   ex[i]= "กำหนดอนุกรมเลขคณิต  60 + 58 + 56 + ... แล้ว `S_20` มีค่าเท่าไร"
    a[i]= "220"
    b[i]= "200"
    c[i]= "180"
    d[i]= "160"
  }
  //30 `
  for(let i =117; i<=120; i++){
   ex[i]= "กำหนดให้ `a_1 = 3 , r = 2 \\ จงหา \\ S_7`"
    a[i]= "371"
    b[i]= "370"
    c[i]= "372"
    d[i]= "368"
  }